#include "header.h"

void imgdeque()
{
    cout << " ◢            ██████╗ ███████╗ ██████╗ ██╗   ██╗███████╗\n"
            "◢███████▕╲    ██╔══██╗██╔════╝██╔═══██╗██║   ██║██╔════╝\n"
            "◥███████  ╲   ██║  ██║█████╗  ██║██╗██║██║   ██║█████╗\n"
            " ◥▕⎯⎯⎯⎯⎯⎯ ╱   ██║  ██║██╔══╝  ╚██████╔╝██║   ██║██╔══╝\n"
            "        ▕╱    ██████╔╝███████╗ ╚═██╔═╝ ╚██████╔╝███████╗\n"
            "              ╚═════╝ ╚══════╝   ╚═╝    ╚═════╝ ╚══════╝\n";
}

void imgmenu1()
{
    cout << "\n     ▛▀▜ ◣      ◢ ▛▀▜       ◢ ▛▀▜ ◣      ◢     ◣\n"
            "   ▛▀▘ ▝▀▜◣    ◢▛▀▘ ▝▀▜    ◢▛▀▘ ▝▀▜◣    ◢▛▀▀▀▀▀▜◣\n"
            "   ▙▄▖ ▗▄▟◤    ◥▙▄▖ ▗▄▟    ◥▙▄▖ ▗▄▟◤    ◥▙▄▄▄▄▄▟◤ \n"
            "     ▙▄▟ ◤      ◥ ▙▄▟       ◥ ▙▄▟ ◤      ◥     ◤\n"
            "\n"
            "1. Добавить  2. Добавить  3. Добавить  4. Удалить\n"
            "  в начало     в конец       после\n"
            "                             кого-то\n\n";
}

void imgmenu2()
{
    cout << "    ◢███◤        ◢           ◢███◣▁      ▄▄▄▄▄▄▄\n"
            "    ██   ╱╲     ◢███████◣    █◤▀◥█╳╲     ▊◣    █\n"
            "   ◥██◤ ╱  ╲    ▁▁▁▁▁▁▁▁▁    █◣▄◢█╳╳▏    ▊█    █\n"
            "    ◥◤  ▔▏▕▔    ╲▁▁▁▁▁▁ ╱    ◥███◤╳╳▏    ▊█    █\n"
            "      ╱▔▔ ╱           ▕╱       ╲╳╳╳╱     ▊█▁▁▁▁█\n"
            "      ▔▔▔▔                      ▔▔▔       ◥\n"
            "5. Сортировка  6. Задний   7. Тасовка   8. Выход\n"
            "                   ход          rng\n\n";
}

int checker()
{
    int i;
    cout << ">>";
    while(!(cin>>i))
    {
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(),'\n');
        cout << "ERROR: наверно не int\n>>";
    }
    return i;
}